/**
 * Created by dustar on 2017/4/26.
 *
 * global.js - 全局变量
 */
var gv = {
    lineHeight: 22, // 层高
    isOnWait: [], // 某楼层上下行键是否已被按下
    floor: 20, // 总楼层数
    elevator: 5, // 电梯数
    color: {
        6: '#cc0022',
        7: '#1cb43a',
        0: '#000000',
        1: '#008AFF', // 色彩搭配
        2: '#ee8811',
        3: '#bb0077',
        4: '#7700bb',
        5: '#007788'
    },
    runCost: 100, // 运行代价，若电梯A空闲，电梯B运行，此时某楼层发出请求且请求方向及楼层相对方向均与电梯B运行方向同向，则电梯A要
    // 多计算一个代价以与电梯B比较。runcost=100时，代价过大，电梯A不受理此类请求
    openTime: 3, // 电梯开门时间，单位为一个Tick
    ev: {}, // 电梯变量
    isOnColdDown: false, // 为了防止按键过快
    coldDownTime: 200, // 冷却时间：200ms
    waitingAnim: ["fa fa-hourglass", 'fa fa-hourglass-1', 'fa fa-hourglass-2', 'fa fa-hourglass-3'], // QUESTIONING时加载动画序列
    names: {
        last: ['朱', '颜', '杜', '吕', '蒋', '王', '张', '陈', '莫', '金', '谢', '薛', '江', '胡',
            '毛', '应', '鹿', '钱', "马", '梁', "袁",
            '季', '范', '牛', '李', '林', '顾', '高', '兰', '邱'
        ],
        first: ['明', '花', '美', '丽', '敏', '霞', '天', '刚', '伟', '航', '樵', '晗', '凯', '松',
            '汁', '强', '平', '鹏', "蛤", '璐', "阳",
            '全', '友', '华', '冰', '源', '琴', '磊', '宇'
        ],
        middle: ['', '小', '大']
    }

}

function Enum() {}
Enum.StateType = {
    Idle: 0,
    Up: 1,
    Down: 2,
    Error: 3
} // 电梯运行状态。空闲：0，上行：1，下行：2，故障：3